{
  "Questions": [
    {
      "id": "1",
      "q": "Which was the first purely object oriented programming language developed?"
    },
    {
      "id": "2",
      "q": "Which feature of OOP indicates code reusability?"
    },
    {
      "id": "3",
      "q": "Who created Ethereum Blockchain? "
    },
    {
      "id": "4",
      "q": "Who first proposed the concept of Blockchain?"
    },
    {
      "id": "5",
      "q": "what is the fastest blockchain in terms of transactions? "
    },
    {
      "id": "6",
      "q": "Which programming language is commonly used in AI?"
    },
    {
      "id": "7",
      "q": "What is the term used to describe the process of verifying transactions on the blockchain?"
    },
    {
      "id": "8",
      "q": "Which type of cable is used to connect devices in a network?"
    },
    {
      "id": "9",
      "q": "Which programming language is used to build smart contracts on the Ethereum blockchain? "
    },
    {
      "id": "10",
      "q": "What was the first computer virus called?"
    },
    {
      "id": "11",
      "q": "Who developed the first graphical user interface (GUI)?"
    },
    {
      "id": "12",
      "q": "What was the first programming language?"
    },
    {
      "id": "13",
      "q": "Who is credited with creating the first computer virus?"
    },
    {
      "id": "14",
      "q": "What was the first video game?"
    },
    {
      "id": "15",
      "q": "What does dApp stands for in web3.0?"
    },
    {
      "id": "16",
      "q": "What do you call a computer on a network that requests files from another computer?"
    },
    {
      "id": "17",
      "q": "'.BAT' extension refers usually to what kind of file?"
    },
    {
      "id": "18",
      "q": "A number that is used to control the form of another number is known as?"
    },
    {
      "id": "19",
      "q": "A function that is called automatically each time an object is destroyed is?"
    },
    {
      "id": "20",
      "q": "What does the acronym 'GPT' stand for in ChatGPT?"
    },
    {
      "id": "21",
      "q": "What is the name of the company that created ChatGPT?"
    },
    {
      "id": "22",
      "q": "What is the name of the algorithm used by Google's search engine to rank web pages? "
    },
    {
      "id": "23",
      "q": "What does EVM stand for in Web3.0?"
    },
    {
      "id": "24",
      "q": "What is the name of the virtual reality headset developed by Facebook?"
    },
    {
      "id": "25",
      "q": "Which search algorithm works by dividing the search interval in half?"
    },
    {
      "id": "26",
      "q": "What is the term used to describe a unique digital asset that is verified on the blockchain? "
    },
    {
      "id": "27",
      "q": "The first graphical browser for the WWW was named?"
    },
    {
      "id": "28",
      "q": "What was the first metaverse application?"
    },
    {
      "id": "29",
      "q": "Which technology is used by Web3 to build decentralized applications?"
    },
    {
      "id": "30",
      "q": "Which hashing algorithm is used in bitcoin blockchain?"
    }
  ]
}
